Y660-Knights/javaWorkSpaceBackUp/HACIGA-IAP-2015-7-31/library/HT32F1653_54_Driver/src/ht32f1653_54_gpio.c
/*********************************************************************************************************//**
 * @file    ht32f1653_54_gpio.c
 * @version $Rev:: 346          $
 * @date    $Date:: 2015-03-08 #$
 * @brief   This file provides all the GPIO and AFIO firmware functions.
 *************************************************************************************************************
 *
 * <h2><center>Copyright (C) 2014 Holtek Semiconductor Inc. All rights reserved</center></h2>
 *
 ************************************************************************************************************/

/* Includes ------------------------------------------------------------------------------------------------*/
#include "ht32f1653_54_gpio.h"

/** @addtogroup HT32F1653_54_Peripheral_Driver HT32F1653/1654 Peripheral Driver
  * @{
  */

/** @defgroup GPIO GPIO
  * @brief GPIO driver modules
  * @{
  */


/* Private function prototypes -----------------------------------------------------------------------------*/
u32 _GPIO_ClockControl(HT_GPIO_TypeDef* GPIOx, ControlStatus Cmd);
u32 _AFIO_ClockControl(ControlStatus Cmd);

/* Private macro -------------------------------------------------------------------------------------------*/
/** @defgroup GPIO_Private_Macro GPIO private macros
  * @{
  */
#if (AUTO_CK_CONTROL == 1)
  #define GPIO_CK_ST       u32 isAlreadyOn
  #define GPIO_CK_ON()     (isAlreadyOn = _GPIO_ClockControl(GPIOx, ENABLE))
  #define GPIO_CK_OFF()    if (isAlreadyOn == FALSE) _GPIO_ClockControl(GPIOx, DISABLE)
  #define AFIO_CK_ST       u32 isAlreadyOn
  #define AFIO_CK_ON()     (isAlreadyOn = _AFIO_ClockControl(ENABLE))
  #define AFIO_CK_OFF()    if (isAlreadyOn == FALSE) _AFIO_ClockControl(DISABLE)
#else
  #define GPIO_CK_ST
  #define GPIO_CK_ON(...)
  #define GPIO_CK_OFF(...)
  #define AFIO_CK_ST
  #define AFIO_CK_ON(...)
  #define AFIO_CK_OFF(...)
#endif
/**
  * @}
  */

/* Global functions ----------------------------------------------------------------------------------------*/
/** @addtogroup GPIO_Exported_Functions GPIO exported functions
  * @{
  */
/*********************************************************************************************************//**
 * @brief Deinitializes the GPIOx peripheral registers to their default reset values.
 * @param GPIOx: where GPIOx is the selected GPIO from the GPIO peripheral.
 * @retval None
 ************************************************************************************************************/
void GPIO_DeInit(HT_GPIO_TypeDef* GPIOx)
{
  RSTCU_PeripReset_TypeDef RSTCUReset = {{0}};

  Assert_Param(IS_GPIO(GPIOx));

  if (GPIOx == HT_GPIOA)
  {
    RSTCUReset.Bit.PA = 1;
  }
  else if (GPIOx == HT_GPIOB)
  {
    RSTCUReset.Bit.PB = 1;
  }
  else if (GPIOx == HT_GPIOC)
  {
    RSTCUReset.Bit.PC = 1;
  }
  else if (GPIOx == HT_GPIOD)
  {
    RSTCUReset.Bit.PD = 1;
  }

  RSTCU_PeripReset(RSTCUReset, ENABLE);
}

/*********************************************************************************************************//**
 * @brief Configure the direction of specified GPIO pins.
 * @param GPIOx: where GPIOx is the selected GPIO from the GPIO peripheral.
 * @param GPIO_PIN: The port pins.
 *        This parameter can be any combination of GPIO_PIN_x.
 * @param Direction: This parameter can be one of below:
 *        @arg GPIO_DIR_IN  : The pins are input mode.
 *        @arg GPIO_DIR_OUT : The pins are output mode.
 * @retval None
 ************************************************************************************************************/
void GPIO_DirectionConfig(HT_GPIO_TypeDef* GPIOx, u16 GPIO_PIN, GPIO_DIR_Enum Direction)
{
  GPIO_CK_ST;

  Assert_Param(IS_GPIO(GPIOx));
  Assert_Param(IS_GPIO_DIR(Direction));

  GPIO_CK_ON();

  if (Direction != GPIO_DIR_IN)
    GPIOx->DIRCR |= GPIO_PIN;
  else
    GPIOx->DIRCR &= ~GPIO_PIN;

  GPIO_CK_OFF();
}

/*********************************************************************************************************//**
 * @brief Configure the pull resistor of specified GPIO pins.
 * @param GPIOx: where GPIOx is the selected GPIO from the GPIO peripheral.
 * @param GPIO_PIN: The port pins.
 *        This parameter can be any combination of GPIO_PIN_x.
 * @param PR: Selection of Pull resistor. This parameter can be one of below:
 *        @arg GPIO_PR_UP      : The pins with internal pull-up resistor
 *        @arg GPIO_PR_DOWN    : The pins with internal pull-down resistor
 *        @arg GPIO_PR_DISABLE : The pins without pull resistor
 * @retval None
 ************************************************************************************************************/
void GPIO_PullResistorConfig(HT_GPIO_TypeDef* GPIOx, u16 GPIO_PIN, GPIO_PR_Enum PR)
{
  GPIO_CK_ST;
  Assert_Param(IS_GPIO(GPIOx));
  Assert_Param(IS_GPIO_PR(PR));

  GPIO_CK_ON();
  if (PR == GPIO_PR_UP)
  {
    GPIOx->PUR |= GPIO_PIN;
    GPIOx->PDR &= ~GPIO_PIN;
  }
  else if (PR == GPIO_PR_DOWN)
  {
    GPIOx->PDR |= GPIO_PIN;
    GPIOx->PUR &= ~GPIO_PIN;
  }
  else
  {
    GPIOx->PUR &= ~GPIO_PIN;
    GPIOx->PDR &= ~GPIO_PIN;
  }
  GPIO_CK_OFF();
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the input control of specified GPIO pins.
 * @param GPIOx: where GPIOx is the selected GPIO from the GPIO peripheral.
 * @param GPIO_PIN: The port pins.
 *        This parameter can be any combination of GPIO_PIN_x.
 * @param Cmd: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void GPIO_InputConfig(HT_GPIO_TypeDef* GPIOx, u16 GPIO_PIN, ControlStatus Cmd)
{
  GPIO_CK_ST;
  Assert_Param(IS_GPIO(GPIOx));
  Assert_Param(IS_CONTROL_STATUS(Cmd));

  GPIO_CK_ON();
  if (Cmd != DISABLE)
    GPIOx->INER |= GPIO_PIN;
  else
    GPIOx->INER &= ~GPIO_PIN;
  GPIO_CK_OFF();
}

