Y660-Knights/javaWorkSpaceBackUp/HACIGA-IAP-2015-7-31/library/HT32F1653_54_Driver/src/ht32f1653_54_gpio.c
/*********************************************************************************************************//**
 * @brief Select the driving current of specified GPIO pins.
 * @param GPIOx: where GPIOx is the selected GPIO from the GPIO peripheral.
 * @param GPIO_PIN: The port pins.
 *        This parameter can be any combination of GPIO_PIN_x.
 * @param Drive: This parameter can be one of below:
 *        @arg GPIO_DV_4MA  : Selects output driving current as 4 mA
 *        @arg GPIO_DV_8MA  : Selects output driving current as 8 mA
 * @retval None
 ************************************************************************************************************/
void GPIO_DriveConfig(HT_GPIO_TypeDef* GPIOx, u16 GPIO_PIN, GPIO_DV_Enum Drive)
{
  GPIO_CK_ST;
  Assert_Param(IS_GPIO(GPIOx));
  Assert_Param(IS_GPIO_DV(Drive));

  GPIO_CK_ON();
  if (Drive != GPIO_DV_4MA)
    GPIOx->DRVR |= GPIO_PIN;
  else
    GPIOx->DRVR &= ~GPIO_PIN;
  GPIO_CK_OFF();
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the open drain function of specified GPIO pins.
 * @param GPIOx: where GPIOx is the selected GPIO from the GPIO peripheral.
 * @param GPIO_PIN: The port pins.
 *        This parameter can be any combination of GPIO_PIN_x.
 * @param Cmd: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void GPIO_OpenDrainConfig(HT_GPIO_TypeDef* GPIOx, u16 GPIO_PIN, ControlStatus Cmd)
{
  GPIO_CK_ST;
  Assert_Param(IS_GPIO(GPIOx));
  Assert_Param(IS_CONTROL_STATUS(Cmd));

  GPIO_CK_ON();
  if (Cmd != DISABLE)
    GPIOx->ODR |= GPIO_PIN;
  else
    GPIOx->ODR &= ~GPIO_PIN;
  GPIO_CK_OFF();
}

/*********************************************************************************************************//**
 * @brief Get the input data of specified port pin.
 * @param GPIOx: where GPIOx is the selected GPIO from the GPIO peripheral.
 * @param GPIO_PIN: This parameter can be GPIO_PIN_x.
 * @return SET or RESET
 ************************************************************************************************************/
FlagStatus GPIO_ReadInBit(HT_GPIO_TypeDef* GPIOx, u16 GPIO_PIN)
{
  FlagStatus result;
  GPIO_CK_ST;
  Assert_Param(IS_GPIO(GPIOx));

  GPIO_CK_ON();
  if ((GPIOx->DINR & GPIO_PIN) != RESET)
    result = SET;
  else
    result = RESET;
  GPIO_CK_OFF();
  return result;
}

/*********************************************************************************************************//**
 * @brief Get the input data of specified GPIO port.
 * @param GPIOx: where GPIOx is the selected GPIO from the GPIO peripheral.
 * @return The value of input data register.
 ************************************************************************************************************/
u16 GPIO_ReadInData(HT_GPIO_TypeDef* GPIOx)
{
  u16 uValue;
  GPIO_CK_ST;
  Assert_Param(IS_GPIO(GPIOx));
  GPIO_CK_ON();
  uValue = (u16)GPIOx->DINR;
  GPIO_CK_OFF();
  return (uValue);
}

/*********************************************************************************************************//**
 * @brief Get the output data of specified port pin.
 * @param GPIOx: where GPIOx is the selected GPIO from the GPIO peripheral.
 * @param GPIO_PIN: This parameter can be GPIO_PIN_x.
 * @return SET or RESET
 ************************************************************************************************************/
FlagStatus GPIO_ReadOutBit(HT_GPIO_TypeDef* GPIOx, u16 GPIO_PIN)
{
  FlagStatus result;
  GPIO_CK_ST;

  Assert_Param(IS_GPIO(GPIOx));
  GPIO_CK_ON();
  if ((GPIOx->DOUTR & GPIO_PIN) != RESET)
    result =  SET;
  else
    result = RESET;
  GPIO_CK_OFF();
  return result;
}

/*********************************************************************************************************//**
 * @brief Get the output data of specified GPIO port.
 * @param GPIOx: where GPIOx is the selected GPIO from the GPIO peripheral.
 * @return The value of output data register.
 ************************************************************************************************************/
u16 GPIO_ReadOutData(HT_GPIO_TypeDef* GPIOx)
{
  u32 uValue;
  GPIO_CK_ST;

  Assert_Param(IS_GPIO(GPIOx));
  GPIO_CK_ON();
  uValue = (u16)GPIOx->DOUTR;
  GPIO_CK_OFF();
  return uValue;
}

/*********************************************************************************************************//**
 * @brief Set the selected port bits of output data.
 * @param GPIOx: where GPIOx is the selected GPIO from the GPIO peripheral.
 * @param GPIO_PIN: Specify the port bit to be set.
 *        This parameter can be any combination of GPIO_PIN_x.
 * @retval None
 ************************************************************************************************************/
void GPIO_SetOutBits(HT_GPIO_TypeDef* GPIOx, u16 GPIO_PIN)
{
  GPIO_CK_ST;
  Assert_Param(IS_GPIO(GPIOx));
  GPIO_CK_ON();
  GPIOx->SRR = GPIO_PIN;
  GPIO_CK_OFF();
}

/*********************************************************************************************************//**
 * @brief Clear the selected port bits of output data.
 * @param GPIOx: where GPIOx is the selected GPIO from the GPIO peripheral.
 * @param GPIO_PIN: Specify the port bit to be clear.
 *        This parameter can be any combination of GPIO_PIN_x.
 * @retval None
 ************************************************************************************************************/
void GPIO_ClearOutBits(HT_GPIO_TypeDef* GPIOx, u16 GPIO_PIN)
{
  GPIO_CK_ST;
  Assert_Param(IS_GPIO(GPIOx));
  GPIO_CK_ON();
  GPIOx->RR = GPIO_PIN;
  GPIO_CK_OFF();
}

/*********************************************************************************************************//**
 * @brief Set or Clear the selected port bits of data.
 * @param GPIOx: where GPIOx is the selected GPIO from the GPIO peripheral.
 * @param GPIO_PIN: Specify the port bits.
 *        This parameter can be any combination of GPIO_PIN_x.
 * @param Status: Specify the value to be put to the selected bits.
 *        This parameter can be one of below:
 *        @arg RESET : To clear the port pins
 *        @arg SET   : To set the port pins
 * @retval None
 ************************************************************************************************************/
void GPIO_WriteOutBits(HT_GPIO_TypeDef* GPIOx, u16 GPIO_PIN, FlagStatus Status)
{
  GPIO_CK_ST;
  Assert_Param(IS_GPIO(GPIOx));
  GPIO_CK_ON();
  if (Status != RESET)
    GPIOx->SRR = GPIO_PIN;
  else
    GPIOx->RR = GPIO_PIN;
  GPIO_CK_OFF();
}

