Y660-Knights/javaWorkSpaceBackUp/HACIGA-IAP-2015-7-31/library/HT32F1653_54_Driver/src/ht32f1653_54_gpio.c
/*********************************************************************************************************//**
 * @brief Put data to the specified GPIO data port.
 * @param GPIOx: where GPIOx is the selected GPIO from the GPIO peripheral.
 * @param Data: Specify the data to be written to the port data register.
 * @retval None
 ************************************************************************************************************/
void GPIO_WriteOutData(HT_GPIO_TypeDef* GPIOx, u16 Data)
{
  GPIO_CK_ST;
  Assert_Param(IS_GPIO(GPIOx));
  GPIO_CK_ON();
  GPIOx->DOUTR = Data;
  GPIO_CK_OFF();
}

/*********************************************************************************************************//**
 * @brief Lock configuration of GPIO pins.
 * @param GPIOx: where GPIOx is the selected GPIO from the GPIO peripheral.
 * @param GPIO_PIN: Specify the port bits.
 *        This parameter can be any combination of GPIO_PIN_x.
 * @retval None
 ************************************************************************************************************/
void GPIO_PinLock(HT_GPIO_TypeDef* GPIOx, u16 GPIO_PIN)
{
  GPIO_CK_ST;
  Assert_Param(IS_GPIO(GPIOx));
  GPIO_CK_ON();
  GPIOx->LOCKR = (u32)0x5FA00000 | GPIO_PIN;
  GPIO_CK_OFF();
}

/*********************************************************************************************************//**
 * @brief Get the lock state of specified GPIO port.
 * @param GPIOx: where GPIOx is the selected GPIO from the GPIO peripheral.
 * @return TRUE or FALSE
 ************************************************************************************************************/
bool GPIO_IsPortLocked(HT_GPIO_TypeDef* GPIOx)
{
  bool result;
  GPIO_CK_ST;

  Assert_Param(IS_GPIO(GPIOx));
  GPIO_CK_ON();
  if ((GPIOx->LOCKR >> 16) == 0)
    result = FALSE;
  else
    result = TRUE;
  GPIO_CK_OFF();
  return result;
}

/*********************************************************************************************************//**
 * @brief Get the lock state of specified GPIO port pin.
 * @param GPIOx: where GPIOx is the selected GPIO from the GPIO peripheral.
 * @param GPIO_PIN: This parameter can be GPIO_PIN_x.
 * @return TRUE or FALSE
 ************************************************************************************************************/
bool GPIO_IsPinLocked(HT_GPIO_TypeDef* GPIOx, u16 GPIO_PIN)
{
  bool result;
  GPIO_CK_ST;

  Assert_Param(IS_GPIO(GPIOx));

  GPIO_CK_ON();
  if ((GPIOx->LOCKR & GPIO_PIN) == 0)
    result = FALSE;
  else
    result = TRUE;
  GPIO_CK_OFF();
  return result;
}

/*********************************************************************************************************//**
 * @brief Deinitialize the AFIO peripheral registers to their default reset values.
 * @retval None
 ************************************************************************************************************/
void AFIO_DeInit(void)
{
  RSTCU_PeripReset_TypeDef RSTCUReset = {{0}};

  RSTCUReset.Bit.AFIO = 1;
  RSTCU_PeripReset(RSTCUReset, ENABLE);
}

/*********************************************************************************************************//**
 * @brief Configure alternated mode of GPIOx with specified pins.
 * @param AFIO_PORT: AFIO_PA ~ AFIO_PE.
 * @param AFIO_PIN: This parameter can be any combination of AFIO_PIN_x.
 * @param AFIO_MODE: This parameter can be one of the following values:
          @arg AFIO_MODE_DEFAULT : The default I/O function
          @arg AFIO_MODE_1       : Alternated mode 1
          @arg AFIO_MODE_2       : Alternated mode 2
          @arg AFIO_MODE_3       : Alternated mode 3
          @arg AFIO_MODE_4       : Alternated mode 4
          @arg AFIO_MODE_5       : Alternated mode 5
          @arg AFIO_MODE_6       : Alternated mode 6
          @arg AFIO_MODE_7       : Alternated mode 7
          @arg AFIO_MODE_8       : Alternated mode 8
          @arg AFIO_MODE_9       : Alternated mode 9
          @arg AFIO_MODE_10      : Alternated mode 10
          @arg AFIO_MODE_11      : Alternated mode 11
          @arg AFIO_MODE_12      : Alternated mode 12
          @arg AFIO_MODE_13      : Alternated mode 13
          @arg AFIO_MODE_14      : Alternated mode 14
          @arg AFIO_MODE_15      : Alternated mode 15
 * @retval None
 ************************************************************************************************************/
#if 1
void AFIO_GPxConfig(u32 AFIO_PORT, u32 AFIO_PIN, AFIO_MODE_Enum AFIO_MODE)
{
  vu32* pGPxCFGR = ((vu32*)&HT_AFIO->GPACFGR[0]) + AFIO_PORT * 2;
  u32 index = 0;
  u32 Mask = 0, PinMode = 0;
  s32 i;
  AFIO_CK_ST;

  Assert_Param(IS_AFIO_MODE(AFIO_MODE));
  AFIO_CK_ON();

  for (i = 0; i <= 8; i += 8)
  {
    Mask = 0;
    PinMode = 0;
    if (AFIO_PIN & (0x00FF << i))
    {
      for (index = 0; index < 8; index++)
      {
        if ((AFIO_PIN >> index) & (0x0001 << i))
        {
          Mask |= (0xF << (index * 4));
          PinMode |= (AFIO_MODE << (index * 4));
        }
      }
      *pGPxCFGR = (*pGPxCFGR & (~Mask)) | PinMode;
    }
    pGPxCFGR++;
  }

  AFIO_CK_OFF();
}
#else
/*********************************************************************************************************//**
 * @brief Configure alternated mode of GPIOA with specified pins.
 * @param AFIO_PIN: This parameter can be any combination of AFIO_PIN_x.
 * @param AFIO_MODE: This parameter can be one of the following values:
          @arg AFIO_MODE_DEFAULT : The default I/O function
          @arg AFIO_MODE_1       : Alternated mode 1
          @arg AFIO_MODE_2       : Alternated mode 2
          @arg AFIO_MODE_3       : Alternated mode 3
          @arg AFIO_MODE_4       : Alternated mode 4
          @arg AFIO_MODE_5       : Alternated mode 5
          @arg AFIO_MODE_6       : Alternated mode 6
          @arg AFIO_MODE_7       : Alternated mode 7
          @arg AFIO_MODE_8       : Alternated mode 8
          @arg AFIO_MODE_9       : Alternated mode 9
          @arg AFIO_MODE_10      : Alternated mode 10
          @arg AFIO_MODE_11      : Alternated mode 11
          @arg AFIO_MODE_12      : Alternated mode 12
          @arg AFIO_MODE_13      : Alternated mode 13
          @arg AFIO_MODE_14      : Alternated mode 14
          @arg AFIO_MODE_15      : Alternated mode 15
 * @retval None
 ************************************************************************************************************/
void AFIO_GPAConfig(u32 AFIO_PIN, AFIO_MODE_Enum AFIO_MODE)
{
  u8 index = 0;
  u32 Mask = 0, PinMode = 0;

